Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM036.atdf
      <value-group caption="Comparator 1 Output bit" name="CMSTAT__C1OUT">
         <value caption="Output of Comparator 1 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 1 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 2 Output bit" name="CMSTAT__C2OUT">
         <value caption="Output of Comparator 2 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 2 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator 3 Output bit" name="CMSTAT__C3OUT">
         <value caption="Output of Comparator 3 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 3 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Reference Voltage Select (CVREFSEL)" name="CMSTAT__CVREFSEL">
         <value caption="External voltage reference from the CVREF+ pin is selected" name="" value="0x1" />
         <value caption="Internal band gap voltage reference is selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CMSTAT__SIDL">
         <value caption="All Comparator modules are disabled in Idle mode" name="" value="0x1" />
         <value caption="All Comparator modules continue to operate in the Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Negative Input Configuration" name="CM1CON__CCH">
         <value caption="Comparator inverting input is connected to the band gap reference voltage" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configuration" name="CM1CON__CREF">
         <value caption="Comparator Non-inverting input connects to the reference defined by the CVREFSEL bit" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Comparator event is generated on any change of the comparator output" name="" value="0x3" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 0) or low-to-high transition (if CPOL = 1) of the comparator output" name="" value="0x2" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 1) or low-to-high transition (if CPOL = 0) of the comparator output" name="" value="0x1" />
         <value caption="Comparator event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="VIN+ is greater than VIN- (if CPOL = 0)/VIN+ is smaller than VIN- (if CPOL = 1)" name="" value="0x1" />
         <value caption="VIN+ is greater than VIN- (if CPOL = 1)/VIN+ is smaller than VIN- (if CPOL = 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM1CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM1CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM1CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Negative Input Configuration" name="CM2CON__CCH">
         <value caption="Comparator inverting input is connected to the band gap reference voltage" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configuration" name="CM2CON__CREF">
         <value caption="Comparator Non-inverting input connects to the reference defined by the CVREFSEL bit" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM2CON__EVPOL">
         <value caption="Comparator event is generated on any change of the comparator output" name="" value="0x3" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 0) or low-to-high transition (if CPOL = 1) of the comparator output" name="" value="0x2" />
         <value caption="Comparator event is generated on a high-to-low transition (if CPOL = 1) or low-to-high transition (if CPOL = 0) of the comparator output" name="" value="0x1" />
         <value caption="Comparator event generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM2CON__COUT">
         <value caption="VIN+ is greater than VIN- (if CPOL = 0)/VIN+ is smaller than VIN- (if CPOL = 1)" name="" value="0x1" />
         <value caption="VIN+ is greater than VIN- (if CPOL = 1)/VIN+ is smaller than VIN- (if CPOL = 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM2CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
