Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM036.atdf
         <value caption="255/512 divisor added to RODIV value" name="" value="0xff" />
         <value caption="254/512 divisor added to RODIV value" name="" value="0xfe" />
         <value caption="253/512 divisor added to RODIV value" name="" value="0xfd" />
         <value caption="252/512 divisor added to RODIV value" name="" value="0xfc" />
         <value caption="251/512 divisor added to RODIV value" name="" value="0xfb" />
         <value caption="250/512 divisor added to RODIV value" name="" value="0xfa" />
         <value caption="249/512 divisor added to RODIV value" name="" value="0xf9" />
         <value caption="248/512 divisor added to RODIV value" name="" value="0xf8" />
         <value caption="247/512 divisor added to RODIV value" name="" value="0xf7" />
         <value caption="246/512 divisor added to RODIV value" name="" value="0xf6" />
         <value caption="245/512 divisor added to RODIV value" name="" value="0xf5" />
         <value caption="244/512 divisor added to RODIV value" name="" value="0xf4" />
         <value caption="243/512 divisor added to RODIV value" name="" value="0xf3" />
         <value caption="242/512 divisor added to RODIV value" name="" value="0xf2" />
         <value caption="241/512 divisor added to RODIV value" name="" value="0xf1" />
         <value caption="240/512 divisor added to RODIV value" name="" value="0xf0" />
         <value caption="239/512 divisor added to RODIV value" name="" value="0xef" />
         <value caption="238/512 divisor added to RODIV value" name="" value="0xee" />
         <value caption="237/512 divisor added to RODIV value" name="" value="0xed" />
         <value caption="236/512 divisor added to RODIV value" name="" value="0xec" />
         <value caption="235/512 divisor added to RODIV value" name="" value="0xeb" />
         <value caption="234/512 divisor added to RODIV value" name="" value="0xea" />
         <value caption="233/512 divisor added to RODIV value" name="" value="0xe9" />
         <value caption="232/512 divisor added to RODIV value" name="" value="0xe8" />
         <value caption="231/512 divisor added to RODIV value" name="" value="0xe7" />
         <value caption="230/512 divisor added to RODIV value" name="" value="0xe6" />
         <value caption="229/512 divisor added to RODIV value" name="" value="0xe5" />
         <value caption="228/512 divisor added to RODIV value" name="" value="0xe4" />
         <value caption="227/512 divisor added to RODIV value" name="" value="0xe3" />
         <value caption="226/512 divisor added to RODIV value" name="" value="0xe2" />
         <value caption="225/512 divisor added to RODIV value" name="" value="0xe1" />
         <value caption="224/512 divisor added to RODIV value" name="" value="0xe0" />
         <value caption="223/512 divisor added to RODIV value" name="" value="0xdf" />
         <value caption="222/512 divisor added to RODIV value" name="" value="0xde" />
         <value caption="221/512 divisor added to RODIV value" name="" value="0xdd" />
         <value caption="220/512 divisor added to RODIV value" name="" value="0xdc" />
         <value caption="219/512 divisor added to RODIV value" name="" value="0xdb" />
         <value caption="218/512 divisor added to RODIV value" name="" value="0xda" />
         <value caption="217/512 divisor added to RODIV value" name="" value="0xd9" />
         <value caption="216/512 divisor added to RODIV value" name="" value="0xd8" />
         <value caption="215/512 divisor added to RODIV value" name="" value="0xd7" />
         <value caption="214/512 divisor added to RODIV value" name="" value="0xd6" />
         <value caption="213/512 divisor added to RODIV value" name="" value="0xd5" />
         <value caption="212/512 divisor added to RODIV value" name="" value="0xd4" />
         <value caption="211/512 divisor added to RODIV value" name="" value="0xd3" />
         <value caption="210/512 divisor added to RODIV value" name="" value="0xd2" />
         <value caption="209/512 divisor added to RODIV value" name="" value="0xd1" />
         <value caption="208/512 divisor added to RODIV value" name="" value="0xd0" />
         <value caption="207/512 divisor added to RODIV value" name="" value="0xcf" />
         <value caption="206/512 divisor added to RODIV value" name="" value="0xce" />
         <value caption="205/512 divisor added to RODIV value" name="" value="0xcd" />
         <value caption="204/512 divisor added to RODIV value" name="" value="0xcc" />
         <value caption="203/512 divisor added to RODIV value" name="" value="0xcb" />
         <value caption="202/512 divisor added to RODIV value" name="" value="0xca" />
         <value caption="201/512 divisor added to RODIV value" name="" value="0xc9" />
         <value caption="200/512 divisor added to RODIV value" name="" value="0xc8" />
         <value caption="199/512 divisor added to RODIV value" name="" value="0xc7" />
         <value caption="198/512 divisor added to RODIV value" name="" value="0xc6" />
         <value caption="197/512 divisor added to RODIV value" name="" value="0xc5" />
         <value caption="196/512 divisor added to RODIV value" name="" value="0xc4" />
         <value caption="195/512 divisor added to RODIV value" name="" value="0xc3" />
         <value caption="194/512 divisor added to RODIV value" name="" value="0xc2" />
         <value caption="193/512 divisor added to RODIV value" name="" value="0xc1" />
         <value caption="192/512 divisor added to RODIV value" name="" value="0xc0" />
         <value caption="191/512 divisor added to RODIV value" name="" value="0xbf" />
         <value caption="190/512 divisor added to RODIV value" name="" value="0xbe" />
         <value caption="189/512 divisor added to RODIV value" name="" value="0xbd" />
         <value caption="188/512 divisor added to RODIV value" name="" value="0xbc" />
         <value caption="187/512 divisor added to RODIV value" name="" value="0xbb" />
         <value caption="186/512 divisor added to RODIV value" name="" value="0xba" />
         <value caption="185/512 divisor added to RODIV value" name="" value="0xb9" />
         <value caption="184/512 divisor added to RODIV value" name="" value="0xb8" />
         <value caption="183/512 divisor added to RODIV value" name="" value="0xb7" />
         <value caption="182/512 divisor added to RODIV value" name="" value="0xb6" />
         <value caption="181/512 divisor added to RODIV value" name="" value="0xb5" />
         <value caption="180/512 divisor added to RODIV value" name="" value="0xb4" />
         <value caption="179/512 divisor added to RODIV value" name="" value="0xb3" />
         <value caption="178/512 divisor added to RODIV value" name="" value="0xb2" />
         <value caption="177/512 divisor added to RODIV value" name="" value="0xb1" />
         <value caption="176/512 divisor added to RODIV value" name="" value="0xb0" />
         <value caption="175/512 divisor added to RODIV value" name="" value="0xaf" />
         <value caption="174/512 divisor added to RODIV value" name="" value="0xae" />
         <value caption="173/512 divisor added to RODIV value" name="" value="0xad" />
         <value caption="172/512 divisor added to RODIV value" name="" value="0xac" />
         <value caption="171/512 divisor added to RODIV value" name="" value="0xab" />
         <value caption="170/512 divisor added to RODIV value" name="" value="0xaa" />
         <value caption="169/512 divisor added to RODIV value" name="" value="0xa9" />
         <value caption="168/512 divisor added to RODIV value" name="" value="0xa8" />
         <value caption="167/512 divisor added to RODIV value" name="" value="0xa7" />
         <value caption="166/512 divisor added to RODIV value" name="" value="0xa6" />
         <value caption="165/512 divisor added to RODIV value" name="" value="0xa5" />
         <value caption="164/512 divisor added to RODIV value" name="" value="0xa4" />
         <value caption="163/512 divisor added to RODIV value" name="" value="0xa3" />
         <value caption="162/512 divisor added to RODIV value" name="" value="0xa2" />
         <value caption="161/512 divisor added to RODIV value" name="" value="0xa1" />
         <value caption="160/512 divisor added to RODIV value" name="" value="0xa0" />
         <value caption="159/512 divisor added to RODIV value" name="" value="0x9f" />
         <value caption="158/512 divisor added to RODIV value" name="" value="0x9e" />
         <value caption="157/512 divisor added to RODIV value" name="" value="0x9d" />
         <value caption="156/512 divisor added to RODIV value" name="" value="0x9c" />
         <value caption="155/512 divisor added to RODIV value" name="" value="0x9b" />
         <value caption="154/512 divisor added to RODIV value" name="" value="0x9a" />
         <value caption="153/512 divisor added to RODIV value" name="" value="0x99" />
         <value caption="152/512 divisor added to RODIV value" name="" value="0x98" />
         <value caption="151/512 divisor added to RODIV value" name="" value="0x97" />
         <value caption="150/512 divisor added to RODIV value" name="" value="0x96" />
         <value caption="149/512 divisor added to RODIV value" name="" value="0x95" />
         <value caption="148/512 divisor added to RODIV value" name="" value="0x94" />
         <value caption="147/512 divisor added to RODIV value" name="" value="0x93" />
         <value caption="146/512 divisor added to RODIV value" name="" value="0x92" />
         <value caption="145/512 divisor added to RODIV value" name="" value="0x91" />
         <value caption="144/512 divisor added to RODIV value" name="" value="0x90" />
         <value caption="143/512 divisor added to RODIV value" name="" value="0x8f" />
         <value caption="142/512 divisor added to RODIV value" name="" value="0x8e" />
         <value caption="141/512 divisor added to RODIV value" name="" value="0x8d" />
         <value caption="140/512 divisor added to RODIV value" name="" value="0x8c" />
         <value caption="139/512 divisor added to RODIV value" name="" value="0x8b" />
         <value caption="138/512 divisor added to RODIV value" name="" value="0x8a" />
         <value caption="137/512 divisor added to RODIV value" name="" value="0x89" />
         <value caption="136/512 divisor added to RODIV value" name="" value="0x88" />
         <value caption="135/512 divisor added to RODIV value" name="" value="0x87" />
         <value caption="134/512 divisor added to RODIV value" name="" value="0x86" />
         <value caption="133/512 divisor added to RODIV value" name="" value="0x85" />
         <value caption="132/512 divisor added to RODIV value" name="" value="0x84" />
         <value caption="131/512 divisor added to RODIV value" name="" value="0x83" />
         <value caption="130/512 divisor added to RODIV value" name="" value="0x82" />
         <value caption="129/512 divisor added to RODIV value" name="" value="0x81" />
         <value caption="128/512 divisor added to RODIV value" name="" value="0x80" />
         <value caption="127/512 divisor added to RODIV value" name="" value="0x7f" />
         <value caption="126/512 divisor added to RODIV value" name="" value="0x7e" />
         <value caption="125/512 divisor added to RODIV value" name="" value="0x7d" />
         <value caption="124/512 divisor added to RODIV value" name="" value="0x7c" />
         <value caption="123/512 divisor added to RODIV value" name="" value="0x7b" />
         <value caption="122/512 divisor added to RODIV value" name="" value="0x7a" />
         <value caption="121/512 divisor added to RODIV value" name="" value="0x79" />
         <value caption="120/512 divisor added to RODIV value" name="" value="0x78" />
         <value caption="119/512 divisor added to RODIV value" name="" value="0x77" />
         <value caption="118/512 divisor added to RODIV value" name="" value="0x76" />
         <value caption="117/512 divisor added to RODIV value" name="" value="0x75" />
         <value caption="116/512 divisor added to RODIV value" name="" value="0x74" />
         <value caption="115/512 divisor added to RODIV value" name="" value="0x73" />
         <value caption="114/512 divisor added to RODIV value" name="" value="0x72" />
         <value caption="113/512 divisor added to RODIV value" name="" value="0x71" />
         <value caption="112/512 divisor added to RODIV value" name="" value="0x70" />
         <value caption="111/512 divisor added to RODIV value" name="" value="0x6f" />
         <value caption="110/512 divisor added to RODIV value" name="" value="0x6e" />
         <value caption="109/512 divisor added to RODIV value" name="" value="0x6d" />
         <value caption="108/512 divisor added to RODIV value" name="" value="0x6c" />
         <value caption="107/512 divisor added to RODIV value" name="" value="0x6b" />
         <value caption="106/512 divisor added to RODIV value" name="" value="0x6a" />
         <value caption="105/512 divisor added to RODIV value" name="" value="0x69" />
         <value caption="104/512 divisor added to RODIV value" name="" value="0x68" />
         <value caption="103/512 divisor added to RODIV value" name="" value="0x67" />
         <value caption="102/512 divisor added to RODIV value" name="" value="0x66" />
         <value caption="101/512 divisor added to RODIV value" name="" value="0x65" />
         <value caption="100/512 divisor added to RODIV value" name="" value="0x64" />
         <value caption="99/512 divisor added to RODIV value" name="" value="0x63" />
         <value caption="98/512 divisor added to RODIV value" name="" value="0x62" />
         <value caption="97/512 divisor added to RODIV value" name="" value="0x61" />
         <value caption="96/512 divisor added to RODIV value" name="" value="0x60" />
         <value caption="95/512 divisor added to RODIV value" name="" value="0x5f" />
         <value caption="94/512 divisor added to RODIV value" name="" value="0x5e" />
         <value caption="93/512 divisor added to RODIV value" name="" value="0x5d" />
         <value caption="92/512 divisor added to RODIV value" name="" value="0x5c" />
         <value caption="91/512 divisor added to RODIV value" name="" value="0x5b" />
         <value caption="90/512 divisor added to RODIV value" name="" value="0x5a" />
         <value caption="89/512 divisor added to RODIV value" name="" value="0x59" />
         <value caption="88/512 divisor added to RODIV value" name="" value="0x58" />
         <value caption="87/512 divisor added to RODIV value" name="" value="0x57" />
         <value caption="86/512 divisor added to RODIV value" name="" value="0x56" />
         <value caption="85/512 divisor added to RODIV value" name="" value="0x55" />
         <value caption="84/512 divisor added to RODIV value" name="" value="0x54" />
         <value caption="83/512 divisor added to RODIV value" name="" value="0x53" />
         <value caption="82/512 divisor added to RODIV value" name="" value="0x52" />
         <value caption="81/512 divisor added to RODIV value" name="" value="0x51" />
         <value caption="80/512 divisor added to RODIV value" name="" value="0x50" />
         <value caption="79/512 divisor added to RODIV value" name="" value="0x4f" />
         <value caption="78/512 divisor added to RODIV value" name="" value="0x4e" />
         <value caption="77/512 divisor added to RODIV value" name="" value="0x4d" />
         <value caption="76/512 divisor added to RODIV value" name="" value="0x4c" />
         <value caption="75/512 divisor added to RODIV value" name="" value="0x4b" />
         <value caption="74/512 divisor added to RODIV value" name="" value="0x4a" />
         <value caption="73/512 divisor added to RODIV value" name="" value="0x49" />
         <value caption="72/512 divisor added to RODIV value" name="" value="0x48" />
         <value caption="71/512 divisor added to RODIV value" name="" value="0x47" />
         <value caption="70/512 divisor added to RODIV value" name="" value="0x46" />
         <value caption="69/512 divisor added to RODIV value" name="" value="0x45" />
         <value caption="68/512 divisor added to RODIV value" name="" value="0x44" />
         <value caption="67/512 divisor added to RODIV value" name="" value="0x43" />
         <value caption="66/512 divisor added to RODIV value" name="" value="0x42" />
         <value caption="65/512 divisor added to RODIV value" name="" value="0x41" />
         <value caption="64/512 divisor added to RODIV value" name="" value="0x40" />
         <value caption="63/512 divisor added to RODIV value" name="" value="0x3f" />
         <value caption="62/512 divisor added to RODIV value" name="" value="0x3e" />
         <value caption="61/512 divisor added to RODIV value" name="" value="0x3d" />
         <value caption="60/512 divisor added to RODIV value" name="" value="0x3c" />
         <value caption="59/512 divisor added to RODIV value" name="" value="0x3b" />
         <value caption="58/512 divisor added to RODIV value" name="" value="0x3a" />
         <value caption="57/512 divisor added to RODIV value" name="" value="0x39" />
         <value caption="56/512 divisor added to RODIV value" name="" value="0x38" />
         <value caption="55/512 divisor added to RODIV value" name="" value="0x37" />
         <value caption="54/512 divisor added to RODIV value" name="" value="0x36" />
         <value caption="53/512 divisor added to RODIV value" name="" value="0x35" />
         <value caption="52/512 divisor added to RODIV value" name="" value="0x34" />
         <value caption="51/512 divisor added to RODIV value" name="" value="0x33" />
         <value caption="50/512 divisor added to RODIV value" name="" value="0x32" />
         <value caption="49/512 divisor added to RODIV value" name="" value="0x31" />
         <value caption="48/512 divisor added to RODIV value" name="" value="0x30" />
         <value caption="47/512 divisor added to RODIV value" name="" value="0x2f" />
         <value caption="46/512 divisor added to RODIV value" name="" value="0x2e" />
         <value caption="45/512 divisor added to RODIV value" name="" value="0x2d" />
         <value caption="44/512 divisor added to RODIV value" name="" value="0x2c" />
         <value caption="43/512 divisor added to RODIV value" name="" value="0x2b" />
         <value caption="42/512 divisor added to RODIV value" name="" value="0x2a" />
         <value caption="41/512 divisor added to RODIV value" name="" value="0x29" />
         <value caption="40/512 divisor added to RODIV value" name="" value="0x28" />
         <value caption="39/512 divisor added to RODIV value" name="" value="0x27" />
         <value caption="38/512 divisor added to RODIV value" name="" value="0x26" />
         <value caption="37/512 divisor added to RODIV value" name="" value="0x25" />
         <value caption="36/512 divisor added to RODIV value" name="" value="0x24" />
         <value caption="35/512 divisor added to RODIV value" name="" value="0x23" />
         <value caption="34/512 divisor added to RODIV value" name="" value="0x22" />
         <value caption="33/512 divisor added to RODIV value" name="" value="0x21" />
         <value caption="32/512 divisor added to RODIV value" name="" value="0x20" />
         <value caption="31/512 divisor added to RODIV value" name="" value="0x1f" />
         <value caption="30/512 divisor added to RODIV value" name="" value="0x1e" />
         <value caption="29/512 divisor added to RODIV value" name="" value="0x1d" />
         <value caption="28/512 divisor added to RODIV value" name="" value="0x1c" />
         <value caption="27/512 divisor added to RODIV value" name="" value="0x1b" />
         <value caption="26/512 divisor added to RODIV value" name="" value="0x1a" />
         <value caption="25/512 divisor added to RODIV value" name="" value="0x19" />
         <value caption="24/512 divisor added to RODIV value" name="" value="0x18" />
         <value caption="23/512 divisor added to RODIV value" name="" value="0x17" />
         <value caption="22/512 divisor added to RODIV value" name="" value="0x16" />
         <value caption="21/512 divisor added to RODIV value" name="" value="0x15" />
         <value caption="20/512 divisor added to RODIV value" name="" value="0x14" />
         <value caption="19/512 divisor added to RODIV value" name="" value="0x13" />
         <value caption="18/512 divisor added to RODIV value" name="" value="0x12" />
         <value caption="17/512 divisor added to RODIV value" name="" value="0x11" />
         <value caption="16/512 divisor added to RODIV value" name="" value="0x10" />
         <value caption="15/512 divisor added to RODIV value" name="" value="0xf" />
         <value caption="14/512 divisor added to RODIV value" name="" value="0xe" />
         <value caption="13/512 divisor added to RODIV value" name="" value="0xd" />
         <value caption="12/512 divisor added to RODIV value" name="" value="0xc" />
         <value caption="11/512 divisor added to RODIV value" name="" value="0xb" />
         <value caption="10/512 divisor added to RODIV value" name="" value="0xa" />
         <value caption="9/512 divisor added to RODIV value" name="" value="0x9" />
         <value caption="8/512 divisor added to RODIV value" name="" value="0x8" />
         <value caption="7/512 divisor added to RODIV value" name="" value="0x7" />
         <value caption="6/512 divisor added to RODIV value" name="" value="0x6" />
         <value caption="5/512 divisor added to RODIV value" name="" value="0x5" />
         <value caption="4/512 divisor added to RODIV value" name="" value="0x4" />
         <value caption="3/512 divisor added to RODIV value" name="" value="0x3" />
         <value caption="2/512 divisor added to RODIV value" name="" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="" value="0x1" />
         <value caption="0 divisor added to RODIV value" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast RC (FRC) Oscillator Ready Status bit" name="CLKSTAT__FRCRDY">
         <value caption="FRC is stable and ready" name="" value="0x1" />
         <value caption="FRC is disabled for not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL Ready Status bit" name="CLKSTAT__SPDIVRDY">
         <value caption="Divided System PLL is ready" name="" value="0x1" />
         <value caption="Divided System PLL is not ready" name="" value="0x0" />
      </value-group>
