Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM036.atdf
         <register caption="" name="CNEN0C" offset="0x520" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0C0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0C1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0C2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0C3" />
            <bitfield caption="" mask="0x00000100" name="CNIE0C8" />
            <bitfield caption="" mask="0x00000200" name="CNIE0C9" />
         </register>
         <register caption="" name="CNSTATC" offset="0x530" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATC0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATC1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATC2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATC3" />
            <bitfield caption="" mask="0x00000100" name="CNSTATC8" />
            <bitfield caption="" mask="0x00000200" name="CNSTATC9" />
         </register>
         <register caption="" name="CNEN1C" offset="0x540" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1C0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1C1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1C2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1C3" />
            <bitfield caption="" mask="0x00000100" name="CNIE1C8" />
            <bitfield caption="" mask="0x00000200" name="CNIE1C9" />
         </register>
         <register caption="" name="CNFC" offset="0x550" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFC0" />
            <bitfield caption="" mask="0x00000002" name="CNFC1" />
            <bitfield caption="" mask="0x00000004" name="CNFC2" />
            <bitfield caption="" mask="0x00000008" name="CNFC3" />
            <bitfield caption="" mask="0x00000100" name="CNFC8" />
            <bitfield caption="" mask="0x00000200" name="CNFC9" />
         </register>
         <register caption="" name="SR0C" offset="0x560" rw="R" size="4" />
         <register caption="" name="SR1C" offset="0x570" rw="R" size="4" />
      </register-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLVDET" values="HLVDCON__HLVDET" />
            <bitfield caption="Internal Reference Voltage Stable Status bit" mask="0x00000200" name="IRVST" values="HLVDCON__IRVST" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="External LVDIN pin" name="" value="0xf" />
         <value caption="VDD trip point is between 2.00V and 2.22V" name="" value="0xe" />
         <value caption="VDD trip point is between 2.08V and 2.33V" name="" value="0xd" />
         <value caption="VDD trip point is between 2.15V and 2.44V" name="" value="0xc" />
         <value caption="VDD trip point is between 2.25V and 2.55V" name="" value="0xb" />
         <value caption="VDD trip point is between 2.35V and 2.69V" name="" value="0xa" />
         <value caption="VDD trip point is between 2.45V and 2.80V" name="" value="0x9" />
         <value caption="VDD trip point is between 2.65V and 2.98V" name="" value="0x8" />
         <value caption="VDD trip point is between 2.75V and 3.09V" name="" value="0x7" />
         <value caption="VDD trip point is between 2.95V and 3.30V" name="" value="0x6" />
         <value caption="VDD trip point is between 3.25V and 3.63V" name="" value="0x5" />
         <value caption="Reserved; do not use" name="" value="0x4" />
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Reserved; do not use" name="" value="0x2" />
         <value caption="Reserved; do not use" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLVDET">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Reference Voltage Stable Status bit" name="HLVDCON__IRVST">
         <value caption="Indicates internal reference voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal reference voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Reference Voltages Stable Status bit" name="HLVDCON__BGVST">
         <value caption="Indicates internal band gap voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal band gap voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Change Direction Select bit" name="HLVDCON__VDIR">
         <value caption="Event occurs when voltage equals or exceeds the trip point (HLVDL)" name="" value="0x1" />
         <value caption="Event occurs when voltage equals or falls below the trip point (HLVDL)" name="" value="0x0" />
      </value-group>
      <value-group caption="HLVD Module Enable bit" name="HLVDCON__ON">
         <value caption="HLVD module is enabled" name="" value="0x1" />
         <value caption="HLVD module is disabled" name="" value="0x0" />
      </value-group>
   </module>
